Revit 2027 API
BuiltInFailures.AnalyticalAutomationFailures.LevelsHiddenInViewWarning Property
 Some levels are hidden. The alignment plans will also consider the hidden levels.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LevelsHiddenInViewWarning { get; }
Public Shared ReadOnly Property LevelsHiddenInViewWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LevelsHiddenInViewWarning {
	FailureDefinitionId^ get ();
}
static member LevelsHiddenInViewWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalAutomationFailures Class
Autodesk.Revit.DB Namespace